In [23]:
import pandas as pd

In [24]:
df_titanic = pd.read_csv("csv_files/t14_titanic.csv")

In [25]:
df_titanic.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [26]:
df_titanic = df_titanic.drop(['PassengerId', 'Name' , 'Ticket' , 'SibSp' , 'Parch', 'Cabin', 'Embarked'],axis='columns')

In [27]:
df_titanic.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [28]:
target = df_titanic.Survived
inputs = df_titanic.drop(['Survived'],axis='columns')

In [29]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [30]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [31]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [32]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [33]:
inputs = inputs.drop(['Sex'],axis='columns')

In [36]:
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [37]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [40]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [41]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [43]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [44]:
len(inputs)

891

In [45]:
len(x_train)

712

In [46]:
len(x_test)

179

In [49]:
from sklearn.naive_bayes import GaussianNB
model_titanic = GaussianNB()

In [51]:
model_titanic.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [52]:
model_titanic.score(x_test,y_test)

0.7541899441340782

In [53]:
x_test.head()

     Pclass    Age     Fare  female  male
188       3  40.00  15.5000       0     1
37        3  21.00   8.0500       0     1
207       3  26.00  18.7875       0     1
39        3  14.00  11.2417       1     0
831       2   0.83  18.7500       0     1

In [54]:
y_test.head()

188    0
37     0
207    1
39     1
831    1
Name: Survived, dtype: int64